Catalogs/УсловияМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>УсловияМаршрутизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыражениеУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомбинацииУсловий</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаУсловия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаданияУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаданияУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыЗаданияУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыЗаданияУсловия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРежимеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВстроенномЯзыке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомбинацияИзДругихУсловий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УсловияМаршрутизации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПредставлениеОтбора) 
			И СпособЗаданияУсловия = Перечисления.СпособыЗаданияУсловия.КомбинацияИзДругихУсловий Тогда
	
		КомпоновщикУсловий = Новый КомпоновщикНастроекКомпоновкиДанных;
		
		СхемаКомпоновкиДанных = Справочники.УсловияМаршрутизации.ПолучитьМакет("Условия");
		
		Настройки = НастройкаКомбинацииУсловий.Получить();
		Если Настройки = Неопределено Тогда
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		КонецЕсли;
		
		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
		КомпоновщикУсловий.Инициализировать(ИсточникНастроек);
		КомпоновщикУсловий.ЗагрузитьНастройки(Настройки);
		
		ПредставлениеОтбора = Строка(КомпоновщикУсловий.Настройки.Отбор);
		
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, "( ", "(");
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, " )", ")");
		
	ИначеЕсли Не ЗначениеЗаполнено(ПредставлениеОтбора) И 
		СпособЗаданияУсловия = Перечисления.СпособыЗаданияУсловия.ВРежимеКонструктора Тогда	
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
		
		ИндексЗначенияПеречисления = Перечисления.ТипыОбъектов.Индекс(ТипОбъекта);
		ИмяЗначенияПеречисления = Метаданные.Перечисления.ТипыОбъектов.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		
		СхемаКомпоновкиДанных = Справочники.УсловияМаршрутизации.ПолучитьМакет(ИмяЗначенияПеречисления);
		
		Настройки = НастройкаУсловия.Получить();
		Если Настройки = Неопределено Тогда
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		КонецЕсли;

		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
		Компоновщик.Инициализировать(ИсточникНастроек);
		Компоновщик.ЗагрузитьНастройки(Настройки);
		
		ПредставлениеОтбора = Строка(Компоновщик.Настройки.Отбор);
		
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, "( ", "(");
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, " )", ")");
		
	КонецЕсли;	
	
КонецПроцедуры
